---
type: FilterStringRuleEvaluator
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# FilterStringRuleEvaluator

`Autodesk.Revit.DB.FilterStringRuleEvaluator` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Evaluate | 2011 | `public bool Evaluate ( string lhs , string rhs , bool caseSensitive )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |